spec/fixtures/soap/xml/IControl.LocalLB.ProfileHttpClass.set_redirect_location_20384f3d32102845975e53737336d878_request.xml

<?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsdl="urn:iControl:LocalLB/ProfileHttpClass"><env:Body><wsdl:set_redirect_location><profile_names><value>test_profile2</value></profile_names><redirect_locations><item><value>new_host</value><default_flag>false</default_flag></item></redirect_locations></wsdl:set_redirect_location></env:Body></env:Envelope>